Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.firewall.google_compute_firewall.custom-rules["gke-ingress"] will be created
+ resource "google_compute_firewall" "custom-rules" {
      + creation_timestamp = (known after apply)
      + description        = "GKE Ingress rule, port same as ClusterIP Service"
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + disabled           = false
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "gke-ingress"
      + network            = "development-vpc"
      + priority           = 1000
      + project            = "dark-axe-359021"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "10.129.0.0/23",
        ]

      + allow {
          + ports    = [
              + "80",
              + "443",
              + "8080",
            ]
          + protocol = "tcp"
        }
    }

  # module.firewall.google_compute_firewall.custom-rules["gke-rdp-access"] will be created
+ resource "google_compute_firewall" "custom-rules" {
      + creation_timestamp = (known after apply)
      + description        = "GKE Ingress rule for RDP access via IAP to winodws nodes"
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + disabled           = false
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "gke-rdp-access"
      + network            = "development-vpc"
      + priority           = 1000
      + project            = "dark-axe-359021"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "35.235.240.0/20",
        ]

      + allow {
          + ports    = [
              + "3389",
            ]
          + protocol = "tcp"
        }
    }

  # module.firewall_rules.google_compute_firewall.rules["allow-ingress"] will be created
+ resource "google_compute_firewall" "rules" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "allow-ingress"
      + network            = "development-vpc"
      + priority           = 1000
      + project            = "dark-axe-359021"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]
      + source_tags        = [
          + "testing",
        ]

      + allow {
          + ports    = [
              + "22",
            ]
          + protocol = "tcp"
        }

      + log_config {
          + metadata = "INCLUDE_ALL_METADATA"
        }
    }

  # module.firewall_rules.google_compute_firewall.rules["egress"] will be created
+ resource "google_compute_firewall" "rules" {
      + creation_timestamp = (known after apply)
      + destination_ranges = [
          + "0.0.0.0/0",
        ]
      + direction          = "EGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "egress"
      + network            = "development-vpc"
      + priority           = 1000
      + project            = "dark-axe-359021"
      + self_link          = (known after apply)

      + allow {
          + ports    = [
              + "22",
            ]
          + protocol = "tcp"
        }

      + log_config {
          + metadata = "INCLUDE_ALL_METADATA"
        }
    }

  # module.nat.google_compute_router.router[0] will be created
+ resource "google_compute_router" "router" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "cloud-nat-nat"
      + network            = "development-vpc"
      + project            = "dark-axe-359021"
      + region             = "us-central1"
      + self_link          = (known after apply)

      + bgp {
          + advertise_mode     = "DEFAULT"
          + asn                = 64514
          + keepalive_interval = 20
        }
    }

  # module.nat.google_compute_router_nat.nat will be created
+ resource "google_compute_router_nat" "nat" {
      + enable_dynamic_port_allocation      = (known after apply)
      + enable_endpoint_independent_mapping = true
      + icmp_idle_timeout_sec               = 30
      + id                                  = (known after apply)
      + min_ports_per_vm                    = 64
      + name                                = "cloud-nat"
      + nat_ip_allocate_option              = "AUTO_ONLY"
      + project                             = "dark-axe-359021"
      + region                              = "us-central1"
      + router                              = "cloud-nat-nat"
      + source_subnetwork_ip_ranges_to_nat  = "ALL_SUBNETWORKS_ALL_IP_RANGES"
      + tcp_established_idle_timeout_sec    = 1200
      + tcp_transitory_idle_timeout_sec     = 30
      + udp_idle_timeout_sec                = 30

      + log_config {
          + enable = false
          + filter = "ALL"
        }
    }

  # module.vpc.google_compute_network_peering_routes_config.psa_routes["1"] will be created
+ resource "google_compute_network_peering_routes_config" "psa_routes" {
      + export_custom_routes = false
      + id                   = (known after apply)
      + import_custom_routes = false
      + network              = "development-vpc"
      + peering              = (known after apply)
      + project              = "dark-axe-359021"
    }

  # module.vpc.google_service_networking_connection.psa_connection["1"] will be created
+ resource "google_service_networking_connection" "psa_connection" {
      + id                      = (known after apply)
      + network                 = "projects/dark-axe-359021/global/networks/development-vpc"
      + peering                 = (known after apply)
      + reserved_peering_ranges = [
          + "myrange",
        ]
      + service                 = "servicenetworking.googleapis.com"
    }

Plan: 8 to add, 0 to change, 0 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with module.cluster.google_container_cluster.cluster,
│   on modules/gke-cluster/main.tf line 46, in resource "google_container_cluster" "cluster":
│   46:   enable_binary_authorization = var.enable_binary_authorization
│ 
│ Deprecated in favor of binary_authorization.
╵

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis-vns3s2yxpa-uc.a.run.app/lock?id=mcdermg%252Fatlantis%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>
Plan: 8 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
